id: 558f15dd-3171-4b11-bf24-31d0810a20e0
name: User made Owner of multiple teams
description: |
  'This detection identifies users who have been made Owner of multiple Teams within a day.
  one hour.This data is a part of Office 365 Connector in Azure Sentinel.'
tactics:
  - PrivilegeEscalation
relevantTechniques:
  - T1078
query: |

  // Adjust this value to change how many teams a user is made owner of before detecting
  let max_owner_count = 3;
  // Change this value to adjust how larger timeframe the query is run over.
  let time_window = 1d;
  OfficeActivity
  | where OfficeWorkload == "MicrosoftTeams" 
  | where Operation == "MemberRoleChanged" or Operation == "MemberAdded"
  | extend Role = tostring(Members[0].Role)
  | extend UPN = tostring(Members[0].UPN)
  | where Role  == "2"
  | summarize count() by UPN
  | where count_ > max_owner_count
  | extend AccountCustomEntity = UPN
